package ru.ereshchenko.MyJava.Chapter06;

public class Task10_Conclusion {

    /*
    Заключение
• Разбиение программ на многочисленные методы, которые можно вызывать при необходимости,
    увеличивает гибкость и упрощает отслеживание ошибок.
• Перегруженные методы имеют то же имя, но принимают другие аргументы.
• Переменные, объявленные внутри метода, имеют локальную область видимости,
    а переменные класса — глобальную область видимости в пределах этого класса.
• Ключевое слово static используется для объявления методов и переменных класса, которые
    имеют глобальную область видимости в пределах этого класса.
• Ключевое слово public явно разрешает доступ из любого класса.
• Объявление класса может содержать ключевое слово extends, в котором указывается суперкласс,
    откуда объявляемый класс будет наследовать свойства.
• Для того чтобы явно обращаться к определенному методу класса или к его переменной,
    можно использовать имя класса и точечную запись.
• Объекты реального мира имеют атрибуты и действия, которые можно представить
    в программах с помощью переменных и методов.
• Объекты в Java создаются как шаблон класса, из которого можно сделать копии (экземпляры).
• У каждого класса существует метод constructor, который можно запустить с помощью
    ключевого слова new для создания экземпляра этого класса.
• Экземпляры наследуют атрибуты и методы класса, из которого они произведены.
• Инкапсуляция защищает переменные экземпляра и методы экземпляра от доступа из внешних классов.
• Ключевое слово private запрещает доступ снаружи класса.
• Метод конструктора можно вызывать для инициализации атрибутов этого объекта.
     */
}
