package ru.ereshchenko.MyJava.Chapter08;

public class Task09_Conclusion {

    /*
    Заключение
• Для создания компонентов графического пользовательского интерфейса используются классы
    библиотеки Java Swing, содержащиеся в пакете javax.swing.
• Окно создается в виде контейнера верхнего уровня JFrame.
• В конструкторе JFrame указывается заголовок окна, размер, операция по умолчанию
    для закрытия и значение видимости.
• Контейнер JPanel отображает более мелкие компоненты, используя менеджер компоновки FlowLayout.
• Конструктор JButton может определять текст и изображения, которые должны быть отображены
    на компоненте «кнопка».
• Изображения, используемые в программе, представляются объектом ImageIcon.
• Если программы должны быть распространены в виде отдельного Java-архива (JAR),
    то они должны использовать объект ClassLoader для указания исходного файла изображения.
• Объект JLabel отображает неизменяемый текст и изображение.
• Текст, который можно редактировать, отображается в полях JTextField и JTextArea.
• Объект JScrollPane организует полосу прокрутки для поля JTextArea.
• При помощи компонентов JCheckBox, JComboBox и JList можно отображать элементы для выбора.
• Компоненты JRadioButton логически группируются при помощи компонента JButtonGroup.
• Класс Color пакета java.awt представляет компоненты RGB зеленого цвета.
• Для создания объектов, представляющих определенное имя, стиль и размер шрифта,
    используется класс Font пакета java.awt.
• При помощи класса Container пакета java.awt несколько контейнеров можно добавлять в контейнер JFrame.
• При создании контейнера JPanel можно указывать менеджер компоновки.
     */
}
