package ru.ereshchenko.MyJava.Chapter04;

public class Task09_Conclusion {
/*
    Заключение
• Любые числовые значения можно конвертировать в другие типы числовых данных с помощью
    приведения типов, а также к строковому типу, используя метод toString().
• Значение строкового типа может быть сконвертировано в целочисленное (int) с помощью
    метода Integer.parseInt(), а также в значение плавающего типа (float), используя метод Float.
    parseFloat().
• Массив — это переменная, которая может содержать множественные значения,
    которые инициализируются списком внутри фигурных скобок.
• Пустой массив может быть создан при помощи ключевого слова new.
• Свойство массива length содержит целочисленную величину, равную числу элементов этого массива.
• К любому элементу массива можно обращаться по его индексу.
• Главный метод программы создает строковый массив с именем
    args, в котором сохраняются аргументы командной строки.
• Первый аргумент командной строки автоматически сохраняется в элементе args[0].
• Множественные аргументы, передаваемые в программу из командной строки,
    должны быть разделены пробелом.
• Циклы являются идеальным способом для того, чтобы прочитать значение,
    хранящееся в элементах массива.
• Данные из нескольких массивов можно комбинировать и формировать из них новый
    массив объединенных данных.
• Многомерные массивы могут содержать множественные наборы значений элементов,
    каждый из которых имеет свою размерность.
• Блок операторов try catch используется для обработки исключений, возникающих на этапе исполнения.
• Класс Exception перехватывает все исключения, включая
    NumberFormatException и ArrayIndexOutOfBoundsException.
• Блок try catch может быть расширен оператором finally, содержащим код,
    который будет выполняться в любом случае.
*/
}
