package ru.ereshchenko.MyJava.Сhapter01;

public class Task06_Conclusion {
    /*
    Заключение
• Java является как языком программирования, так и исполняемой платформой.
• Программы на Java можно писать в виде обычного текста и сохранять в файлах с расширением .java.
• Задача компилятора javac заключается в компиляции файлов программ .class из первоначальных
    файлов исходного кода .java.
• Интерпретатор java исполняет скомпилированные программы,
    используя экземпляр виртуальной машины Java (Java VM).
• Виртуальная машина Java доступна на многих операционных системах.
• Добавление подкаталога bin в системную переменную PATH позволяет запускать компилятор
    javac из любого расположения.
• Язык Java чувствителен к регистру.
• Стандартный метод main является точкой входа в программы на Java.
• Оператор System.out.println() предназначен для вывода текста.
• Имя файла программы на Java должно полностью совпадать с именем класса.
• Переменные в Java должны быть названы в соответствии с определенными соглашениями по именованию,
    и при этом не должны использоваться ключевые слова языка.
• Каждый оператор в Java должен быть завершен символом точки с запятой.
• Наиболее распространенные типы данных в Java — это String (строковые),
    int (целочисленные), char (символьные), float (с плавающей точкой) и boolean (логические).
• Значения строкового типа должны быть заключены в двойные кавычки,
    символьные — в одинарные кавычки, а значения с плавающей точкой должны содержать суффикс f.
• Для создания переменных, являющихся константами, используется ключевое слово final.
//•   В любую Java-программу можно добавлять многострочные комментарии, находящиеся между символами /* и */
//    либо однострочные, указываемыми после символов //.
//    Проблемы компиляции и исполнения идентифицируются с помощью
//    сообщения об ошибках.
}
