package ru.ereshchenko.MyJava.Chapter07;

public class Task09_Conclusion {
    /*
    Заключение
• Для того чтобы в программе использовать функциональность других классов,
    применяется оператор import, который ставится в начале программы.
• Оператор import может импортировать как отдельные классы,
    определенные по имени, так и классы пакета при помощи символа шаблона *.
• Для обработки процедур ввода и вывода существует пакет java.io.
• Объект File можно использовать для доступа к файлам и ката логам.
• Объект InputStreamReader декодирует введенные байты в символы,
    а объект BufferedReader читает эти декодированные символы.
• Для декодирования байтов текстового файла в символы используется объект FileReader.
• Объекты FileWriter и BufferedWriter можно использовать для
    создания и изменения текстового файлов.
• Пакет java.util содержит утилиты для обработки наборов данных, подобных массивам класса Arrays.
• В пакете java.util содержится также класс ArrayList, у которого есть методы
    для обработки элементов последовательностей.
• Объект ArrayList — это набор, который должен указывать тип элемента,
    содержащегося в списке, например <String>.
• Лямбда-выражение — это анонимный метод, который определяется сразу же на месте выполнения.
• Пакет java.time содержит класс LocalDateTime, представляющий поля для компонентов даты и времени.
• Пакет java.text содержит класс NumberFormat, который используется для форматирования
    чисел и значений валют.
• Пакет java.time.format содержит класс DateTimeFormatter, который
    определяет шаблоны для форматирования значений даты и времени.
     */
}
