package ru.ereshchenko.MyJava.Chapter03;

public class Task09_Conclusion {
    /*
    Заключение
• Ключевое слово if используется для оценки проверочного выражения на предмет
    логических значений true или false.
• Блок операторов if может содержать один или более операторов,
    которые выполняются только тогда, когда проверочное выражение возвращает значение true.
• Ключевое слово else определяет альтернативные операторы для
    выполнения программы в случае, когда проверка, выполняемая ключевым словом if,
    возвращает значение false.
• Комбинация операторов if else позволяет программе осуществлять условное ветвление.
• Оператор switch в большинстве случаев предлагает хорошую альтернативу операторам if else,
    предоставляя различные опции для выбора.
• Каждая опция case может быть завершена ключевым словом break,
    и, таким образом, выполняться будут только операторы, связанные с этой опцией.
• Ключевое слово default может определять операторы, исполняемые в случае,
    когда все опции case возвращают значение false.
• Цикл с периодичностью исполняет операторы, содержащиеся
    в нем, до тех пор, пока проверочное выражение не возвратит значение false.
• После ключевого слова for в скобках указываются инициализатор,
    проверочное выражение и модификатор счетчика.
• В циклах while и do-while во избежание входа в бесконечный цикл
    нужно изменять значение переменной, используемой в проверочном выражении.
• В циклах for и while проверочное выражение оценивается в самом
    начале — перед первой итерацией цикла.
• В циклах do-while проверочное выражение оценивается в конце
    цикла — после первой итерации.
• Итерацию цикла можно пропустить с помощью ключевого слова continue.
• Используя ключевое слово break, можно завершать работу цикла.
• Вложенные внутренние циклы могут использовать метки вместе
    с ключевыми словами break и continue, чтобы передавать управление внешнему циклу. */
}
