package ru.ereshchenko.MyJava.Chapter05;

public class Task11_Conclusion {

    /*
    Заключение
• В документации по языку Java можно найти информацию о методах и свойствах для каждого класса.
• Базовые классы языка Java содержатся в пакете java.lang.
• Класс Math предоставляет константы Math.PI и Math.E.
• Метод Math.pow() осуществляет возведение в указанную степень, а метод Math.sqrt()
    возвращает квадратный корень указанного числа.
• Числа можно округлять до целых значений, используя методы
    Math.round(), Math.floor() и Math.ceil().
• При помощи методов Math.max() и Math.min() можно сравнивать числа.
• Метод Math.random() возвращает случайное число двойной точности в диапазоне
    от 0,0 до 0,999999999999999.
• Строка представляет собой 0 или более символов, заключенных в знаки кавычек.
• Подобно свойству массива length метод length() возвращает размер строки.
• Метод concat() используется для добавления одной строки к другой .
• Метод equals() возвращает значение true только в том случае,
    когда две строки содержат идентичные символы в одинаковом порядке.
• Регистр символа строки можно изменять, используя методы toUpperCase() и toLowerCase().
• Используя методы startsWith() и endsWith(), можно сравнивать строки.
• При помощи методов indexOf() и substring() можно производить
    поиск подстроки в указанной строке.
• Метод isEmpty() возвращает значение true только в том случае,
    когда строка не содержит ни одного символа.
• Для работы с символами строки используются методы trim(), charAt() и replace()
    */
}
