package ru.ereshchenko.MyJava.Chapter09;

public class Task08_Conclusion {

    /*
    Заключение
• Для добавления одного или нескольких интерфейсов EventListener в объявление класса
    используется ключевое слово implements.
• Чтобы заставить компонент сгенерировать событие ActionEvent при его активации,
    используется метод компонента addActionListener(), который принимает в качестве
    аргумента ключевое слово this.
• Интерфейс ActionListener передает сгенерированное событие ActionEvent в качестве
    аргумента методу-обработчику события actionPerformed(), который может
    реагировать на нажатие кнопки пользователем.
• Для того чтобы идентифицировать компонент, который сгенерировал событие,
    используется метод getSource().
• Интерфейс ItemListener создает сгенерированное событие ItemEvent в качестве
    аргумента методу-обработчику itemStateChanged(), который может реагировать
    на выбор элемента пользователем.
• Для идентификации компонента, сгенерировавшего событие, используется метод getItemSelectable().
• Интерфейс KeyListener передает сгенерированное событие KeyEvent в качестве аргумента
    трем обязательным методам- обработчикам событий, которые могут реагировать на нажатие кнопки
    пользователем и возвращать символ, соответствующий нажатой кнопке.
• Интерфейс MouseListener передает сгенерированное событие MouseEvent в качестве
    аргумента пяти обязательным методамобработчикам, которые могут реагировать
    на действия пользователя с мышью.
• Интерфейс MouseMotionListener передает сгенерированное событие MouseEvent в качестве аргумента
    двум обязательным обработчикам событий, которые могут реагировать на движения указателя мыши.
• Метод showMessageDialog() класса JOptionPane создает диалоговое окно, отображающее пользователю
    сообщение, а для запроса пользовательского ввода используются методы showInputDialog()
    и showConfirmationDialog().
• Звуковые ресурсы могут представляться при помощи класса AudioClip пакета java.applet
    и проигрываются при помощи метода этого класса play()
     */
}
